advanced/cylinderAMR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          0.025;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.9;
maxAlphaCo      0.9;

maxDeltaT       1;


functions
{
    #includeFunc  yPlus	
    // #includeFunc  wallShearStress
    // #includeFunc  vorticity
    #includeFunc  "FO_forces"

    forceCoeffs
    {
        type                forceCoeffs;
        libs  ( "libforces.so" );
        writeControl       timeStep;
        writeInterval      1;
    
        patches             ( "cylinder" );
        pName               p;
        UName               U;
        rho                 rhoInf;

        log                 true;
        
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        CofR                (0 0 0);
        pitchAxis           (0 0 1);
        
        magUInf             1;
        rhoInf              1;
        lRef                1;
        Aref                2;
    }


    grad1
    {
        // Mandatory entries (unmodifiable)
        type            grad;
        libs            (fieldFunctionObjects);

        // Mandatory (inherited) entries (runtime modifiable)
        field           U;

        // Optional (inherited) entries
        result          gradU;
        region          region0;
        enabled         true;
        log             false;
        executeControl  timeStep;
        executeInterval 40;
        writeControl    timeStep;
        writeInterval   80;
    }

    mag1
    {
        // Mandatory entries (unmodifiable)
        type            mag;
        libs            (fieldFunctionObjects);

        // Mandatory (inherited) entries (runtime modifiable)
        field           gradU;

        // Optional (inherited) entries
        result          velocityGradientMag;
        region          region0;
        enabled         true;
        log             false;
        executeControl  timeStep;
        executeInterval 40;
        writeControl    timeStep;
        writeInterval   80;
    }
}


// ************************************************************************* //
