advanced/cylinderAMR/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

xmin -25;
xmax 60;
ymin -10;
ymax 10;
zmin -1;
zmax 1;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
	
	($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (85 20 2) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 4 7 3)
        );
    }
	
	outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
        );
    }
	
	front
    {
        type empty;
        faces
        (
			(4 5 6 7) // front
        );
    }
	
	back
    {
        type empty;
        faces
        (
			(0 1 2 3) // back
        );
    }

	top
    {
        type patch;
        faces
        (
			(3 7 6 2) // top		
        );
    }

    bottom
    {
        type patch;
        faces
        (
			(0 4 5 1) // bottom
        );
    }

);

// ************************************************************************* //
