advanced/cylinderAMR/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    // default         Gauss linear;
    default         cellMDLimited Gauss linear 1;
    grad(U)         cellMDLimited Gauss linear 1;    
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    turbulence      Gauss linear;
    // div(phi,U)      Gauss limitedLinearV 1;
    // turbulence      Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;
    div(phi,omega)  $turbulence;
    // div(phi,R)      Gauss limitedLinear 1;
    // div(R)          Gauss linear;
    // div(U)          Gauss linear;             // enables div function object
    // div(phi,nuTilda) Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1.0;
    // default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1.0;
    // default         corrected;
}


wallDist
{
    method          meshWave;
}
// ************************************************************************* //
