advanced/cylinderAMR/system/FO_forces
type                forces;
libs  ("libforces.so");
writeControl       timeStep;
writeInterval      20;

patches             ("cylinder");
pName               p;
UName               U;
rho                 rhoInf;

log                 true; 
CofR                (0 0 0);     
rhoInf              1;